#1. Методы Ruby Core API
#------------------------------------------------------------------------------
  #Для класса Hash:
# delete_if {| key, value | block } → hsh   #Метод, принимающий блок и удаляющий
                            #пару, если условие внутри блока вычисляется в true

# empty?                  #Метод, проверяющий пуст ли хэш

#dig(key, ...) → object   #Метод, принимающий аргументы переменной длины,
                          # каждый из которых является ключом хэша.
#------------------------------------------------------------------------------
